Autodesk.Revit.DB.ValueAtPointBase.GetFlags(System.Int32)
Returns flags for the given measurement.
measurement:
Measurement number for which flags are returned.
Returns:
Flags value for the measurement.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for measurement is negative.
Since:
2012

Autodesk.Revit.DB.ValueAtPointBase.ClearFlagsAt(System.Int32)
Sets flags for the given measurement to ValueAtPointFlags::None.
measurement:
Measurement for which to clear flags.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for measurement is negative.
Since:
2012

Autodesk.Revit.DB.ValueAtPointBase.ClearAllFlags
Sets flags for all measurements to ValueAtPointFlags::None.
Since:
2012

Autodesk.Revit.DB.ValueAtPointBase.SetFlags(System.Int32,System.Int32)
Sets the flags associated to a given measurement.
flags:
The value of the flags to set.
Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
measurement:
Measurement for which to set flags.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for measurement is negative.
Since:
2014

Autodesk.Revit.DB.ValueAtPointBase.SetFlags(System.Int32)
Sets the flags associated to all measurements to the same value.
flags:
Value of flags, uniform for all measurements.
Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
Since:
2012

Autodesk.Revit.DB.ValueAtPointBase.SetFlags(System.Collections.Generic.IList{System.Int32})
Independently sets the flags associated to all measurements.
Remarks:
If you set the array of flags to only contain one value, this flags value will apply to all measurements
flags:
An array of flags values. Each member corresponds to a measurement.
Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
Number of measurements is set at creation of SpatialFieldManager in method createSpatialFieldManager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ValueAtPointBase.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ValueAtPointBase
A base class representing storage of values at a given point.
Remarks:
This class stores a set of measurements and corresponding mapped flags.
The flags are defined in the enumerated type ValueAtPointFlags.
Since:
2012